# Задача 2
print("Добро пожаловать!")
result = int(input("Введите время в секундах: "))
a = (result)
clock = 3600
b = (clock)
minite = 60
c = (minite)
d = round((a / b), 2)
e = round((a / c), 2)
print("Часы: ", d, "или", "Минуты:", e, "или", "Секунды:", a)
