# Задача 3. 
print("Привет!")
number = int(input("Введите любое число от 1 до 9 :"))
a = (number)
print(a)
print("Числа :", a, a*11, a*111)
print("Сумма чисел :", a + a * 11 + a * 111)
