# Задача 4
print("Привет!")
number = 0
n = int(input("Введите любое целое  число от 0 до 999 :"))
a = n % 10
b = n // 10 % 10
c = n // 100
print("Состав введенного числа : ", c, b, a)    #(a * 100 + b * 10 + c)
