# Задача 5.
revenue = int(input("Введите : Выручка фирмы за месяц: "))
costs = int(input("Введите : Издержки фирмы за месяц: "))
staff = int(input("Введите : Количество сотрудников фирмы: "))
a = (revenue)
b = (costs)
c = (staff)
profit = (a - b)
e = (profit)
#d = (profstaf)
print("Прибыль/убыток фирмы за месяц :", e)
print("Прибыль/убыток фирмы на одного сотрудника за месяц :", e / c)
print("Рентабельность фирмы  :", e / a)

