'''
Реализовать программу работы с органическими клетками. Необходимо создать класс Клетка. В его конструкторе
инициализировать параметр, соответствующий количеству клеток (целое число). В классе должны быть реализованы методы
перегрузки арифметических операторов: сложение (__add__()), вычитание (__sub__()), умножение (__mul__()),
деление (__truediv__()).Данные методы должны применяться только к клеткам и выполнять увеличение, уменьшение,
умножение и обычное (не целочисленное) деление клеток, соответственно. В методе деления должно осуществляться
округление значения до целого числа.
Сложение. Объединение двух клеток. При этом число ячеек общей клетки должно равняться сумме ячеек исходных двух клеток.
Вычитание. Участвуют две клетки. Операцию необходимо выполнять только если разность количества ячеек двух клеток
больше нуля, иначе выводить соответствующее сообщение.
Умножение. Создается общая клетка из двух. Число ячеек общей клетки определяется как произведение количества ячеек
этих двух клеток.
Деление. Создается общая клетка из двух. Число ячеек общей клетки определяется как целочисленное деление количества
ячеек этих двух клеток.
В классе необходимо реализовать метод make_order(), принимающий экземпляр класса и количество ячеек в ряду. Данный
метод позволяет организовать ячейки по рядам.
Метод должен возвращать строку вида *****\n*****\n*****..., где количество ячеек между \n равно переданному аргументу.
Если ячеек на формирование ряда не хватает, то в последний ряд записываются все оставшиеся.
Например, количество ячеек клетки равняется 12, количество ячеек в ряду — 5. Тогда метод make_order()
вернет строку: *****\n*****\n**.
Или, количество ячеек клетки равняется 15, количество ячеек в ряду — 5. Тогда метод make_order()
вернет строку: *****\n*****\n*****.
'''
class Organic_Cage:

    def __init__(self, quantity):
        self.quantity = int(quantity)
        #self.other = int(other)

    def __str__(self):
        return f'Result operation Organic cage in number cage: \n{self.quantity * "*"}'

    def __add__(self, other):
        return Organic_Cage(self.quantity + other.quantity)

    def __sub__(self, other):
        return Organic_Cage(self.quantity - other.quantity)

    def __mul__(self, other):
        return Organic_Cage(int(self.quantity * other.quantity))

    def __truediv__(self, other):
        return Organic_Cage(round(self.quantity // other.quantity))

    def make_order(self, cages_in_row):
        row = ''
        for i in range(int(self.quantity / cages_in_row)):
            row += f'{"*" * cages_in_row} \n'
        row += f'{"*" * (self.quantity % cages_in_row)}'

        return row

cage1 = Organic_Cage (90)
cage2 = Organic_Cage (40)
print(cage1)
print(cage2)
print(cage1 + cage2)
print(cage1 / cage2)
print(cage1 - cage2)
print(cage1.make_order(50))
print(cage2.make_order(10))
