# 1 вариант
n = input("Введите месяц в виде целого положительного числа от 1 до 12 - ")

while int(n) < 0 or int(n) > 12:
    print('Внимательно читайте условие!!!')
    n = input("Введите месяц в виде целого положительного числа от 1 до 12 - ")

year = ('12 1 2 3 4 5 6 7 8 9 10 11 ').split()
print(year)

winter = (year[0:3])
print('ЗИМА', (winter))
spring = (year [3:6])
print('ВЕСНА', (spring))
summer = (year [6:9])
print('ЛЕТО', (summer))
autmn = (year [9:13])
print('ОСЕНЬ', (autmn))
dict_year = dict({'ЗИМА': (1, 2, 12), 'ВЕСНА': (3, 4, 5), 'ЛЕТО': (6, 7, 8), 'ОСЕНЬ': (9, 10, 11)})
print(dict_year)

# 2 Вариант
print('------------------------------------->')
year = {'ЗИМА': (1, 2, 12),
           'ВЕСНА': (3, 4, 5),
           'ЛЕТО': (6, 7, 8),
           'ОСЕНЬ': (9, 10, 11)}

month = int(input('Введите месяц в виде целого положительного числа от 1 до 12 - '))
while int(month) < 0 or int(month) > 12:
    print('Внимательно читайте условие!!!')
    month = int(input("Введите месяц в виде целого положительного числа от 1 до 12 - "))

    for key in year.keys():
        if month in year[key]:
            print(key)
